[
  {
    "course code": "CSM",
    "course title": "Certified ScrumMaster",
    "partner": "Scrum Alliance",
    "course type": "Public",
    "roles": [
      "Scrum Master"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/Certified Scrum Master.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "A Certified ScrumMaster® is able to assist a scrum team to perform at their optimum level, as well as buffering the team from distractions.  The certification process teaches the Scrum framework and enables CSMs to expand their career opportunities using Agile practices.",
      "what youll learn": "After successfully completing the course, participants will have an understanding of team roles, events and artifacts.  They will be eligible to take CSM test, and upon passing the test, will be asked to accept the CSM License Agreement and complete their Scrum Alliance profile.",
      "length": "Length: 16 hours (2 days) in-person class, or 25 hours in-person coaching",
      "effort": "5 hrs/week",
      "reviews": [
        "This class gave me the exposure to agile and the scrum process that I needed. Thanks!",
        "I started with very little knowledge about how agile actually works, but the class provided more than enough to start implementing the techniques at my company.",
        "When I began my training I thought that a scrum master was just a project manager.  The class showed me how the roles are different and how to get a team to work toward a common goal.",
        "My instructor was great. They kept the energy level high, and everyone in the class passed the CSM certification on their first try.  Highly recommended."
      ]
    },
    "classes": [
      {
        "start date": "2020-06-10",
				"end date": "2020-06-11",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-07-14",
				"end date": "2020-07-15",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "CSPO",
    "course title": "Certified Scrum Product Owner",
    "partner": "Scrum Alliance",
    "course type": "Public",
    "roles": [
      "Product Owner",
      "Business Analyst"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/Certified Scrum Product Owner.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "A Scrum Product Owner generally comes from the business side of the organization.  In the agile world, the product owner not only manages the vision and backlog, they also help focus the team on providing the outcomes that will delight the customers.",
      "what youll learn": "After successfully completing the course, product owners will have experience as the conduit between the business and the rest of the scrum team.  They’ll learn the skill set that will help them direct the backlog and impart their vision to the team. They will be asked to accept the CSPO License Agreement and complete their Scrum Alliance profile.",
      "length": "16 hours (2 days) in-person class, or 25 hours in-person coaching",
      "effort": "5 hrs/week",
      "reviews": [
        "I got a lot from this class.  I’m now able to better manage my team’s backlog, and our outcomes have really improved.",
        "I started with very little knowledge about how agile actually works, but the class provided more than enough to start implementing the techniques at my company.",
        "The class showed me how the product manager role guides a team to work toward a common goal.",
        "My instructor was great. He kept the energy level high, and made it easy to learn the material.  Highly recommended."
      ]
    },
    "classes": [
      {
        "start date": "2020-08-18",
				"end date": "2020-08-19",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-09-08",
				"end date": "2020-09-09",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "CSD",
    "course title": "Certified Scrum Developer",
    "partner": "Scrum Alliance",
    "course type": "Public",
    "roles": [
      "Developer",
      "QA",
      "UI/UX"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/Certified Scrum Developer.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "Designed for developers, this course will hone your agile skills.  Through both formal training and an assessment of your technical skills, you’ll obtain a working knowledge of Scrum and Agile principles.  In addition, you’ll learn the engineering skills used by Agile developers.  The course instructs developers in the tools and techniques for delivering code in an iterative process, key to Agile software development.",
      "what youll learn": "Upon completing this course, you will have mastered the skill set required to engage in an Agile development environment.  You’ll become proficient with the tools and techniques used to contribute to an agile team.  Certification as a Certified Scrum Developer demonstrates your commitment to the Agile principles.",
      "length": "40 hours (5 days) in-person class, or 50 hours in-person coaching",
      "effort": "5 hrs/week",
      "reviews": [
        "This class gave me the exposure to agile and the scrum process that I needed. Thanks!",
        "I started with very little knowledge about how agile actually works, but the class provided more than enough to start implementing the techniques at my company.",
        "Developing in an Agile environment is different than I had expected.  The class showed me the iterative approach and the tools used to deliver good code.",
        "My instructor was great. Five days of training seemed like it would be tough, but the time was well spent.  Highly recommended."
      ]
    },
    "classes": [
      {
        "start date": "2020-06-17",
				"end date": "2020-06-18",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-07-21",
				"end date": "2020-07-22",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "PSM",
    "course title": "Professional Scrum Master",
    "partner": "Scrum.org",
    "course type": "Public",
    "roles": [
      "Scrum Master"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/Professional Scrum Master logo.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "This two-day course covers the principles and theory that provide the foundation for the Scrum framework, as well as the Scrum Master’s role in that process.  In this team learning approach, students not only learn the tools for success as a Scrum Master, they also hone their new skills with their classmates to better prepare them to return to their workplaces with a new outlook.\nThe PSM course goes beyond presenting slides and charts.  It includes interactive discussions, hands-on exercises based on real world experience, and incorporates these to reinforce scrum values.",
      "what youll learn": "After completing the course, participants will have gained a background in the various components of the Scrum framework.  They will also be provided a password to attempt the Professional Scrum Master I (PSM-I) certification assessment.",
      "length": "16 hours (2 days) in-person class, or 25 hours in-person coaching",
      "effort": "5 hrs/week",
      "reviews": [
        "This class gave me the exposure to agile and the scrum process that I needed. Thanks!",
        "I started with very little knowledge about how agile actually works, but the class provided more than enough to start implementing the techniques at my company.",
        "When I began my training I thought that a scrum master was just a project manager.  The class showed me how the roles are different and how to get a team to work toward a common goal.",
        "My instructor was great. They kept the energy level high, and everyone in the class passed the PSM I assessment on their first try.  Highly recommended."
      ]
    },
    "classes": [
      {
        "start date": "2020-10-15",
				"end date": "2020-10-16",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-10-21",
				"end date": "2020-10-22",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "PSPO",
    "course title": "Professional Scrum Product Owner",
    "partner": "Scrum.org",
    "course type": "Public",
    "roles": [
      "Product Owner",
      "Business Analyst"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/Professional Scrum Product Owner.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "A course to prepare for Professional Scrum Product Owner Certification",
      "what youll learn": "This two-day course is intended for those with a background in the software industry, whether or not you have previous experience as a product owner. From the product owner’s perspective we examine the key concepts behind iterative software development in an Agile Scrum environment. Our instructors provide real examples from industry that demonstrate the product owner’s roles and responsibilities. From creating user stories to managing product backlogs, to demonstrating value and incremental and iterative delivery, the product owner’s role is clearly explained Our instructors also cover the daily responsibilities of Agile team members and their use of Scrum, Kanban, and Extreme Programming.",
      "length": "2 days",
      "effort": "2 days",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-05-02",
				"end date": "2020-05-03",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-05-30",
				"end date": "2020-06-01",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "PSD",
    "course title": "Professional Scrum Developer",
    "partner": "Scrum.org",
    "course type": "Public",
    "roles": [
      "Developer",
      "QA",
      "UI/UX",
      "Content Writer"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/Professional Scrum Developer.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "Preparation for Scrum.org’s certification as a Professional Scrum Developer ",
      "what youll learn": "The Professional Scrum Developer training provides an in-depth understanding of the most important Scrum lessons, drawing from classic texts like the Agile Manifesto and the Scrum Guide, by Ken Schwaber and Jeff Sutherland. The course is hands-on, with activities drawn from real-world situations. You will be a member of an Agile team, face real-world challenges, and participate in an actual iterative development effort. All the while, our expert trainers will be there to demonstrate proper technique and to guide you to prepare for the certification exam.",
      "length": "3 days",
      "effort": "8 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-04-22",
				"end date": "2020-04-23",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-04-05",
				"end date": "2020-04-06",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "SPC",
    "course title": "Implementing SAFe",
    "partner": "Scaled Agile",
    "course type": "Public",
    "roles": [
      "Scrum Master",
      "Product Owner",
      "Business Analyst",
      "Developer",
      "QA",
      "UI/UX",
      "Content Writer"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/Safe Fro Teams.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": " If you are looking to learn the skills needed in order to lead a Lean-Agile transformation in an organization at any level, this course is for you. In four days, you will learn how to best use and incorporate the Scaled Agile Framework® (SAFe®) in order to lead any organization through  the Lean-Agile transformative process. You will learn about seven different core competencies that have been identified within any Lean Enterprise. Trainers will provide you not only with knowledge and skills, but with hands-on practice on coaching programs, constructing a Continuous Delivery Pipeline, strengthening a Lean Portfolio in an organization, and leading the start of Agile Release Trains.",
      "what youll learn": "The course is divided into two sections. The first section will take place on the first two days. During this time, you will gain a thorough understanding of what Leading SAFe® is all about and why it is important in a Lean organization. The last two days of the course will be an intensive time looking at how to implement the SAFe® concepts. You will learn exactly what needs to taken place and what you will need to do in order to implement these concepts as you lead an organization into a Lean transformation. After this course, you will be fully equipped to coach and direct an enterprise at any level to success in the Lean transformative process.",
      "length": "4 days",
      "effort": "32 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-04-25",
				"end date": "2020-04-28",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-10-06",
				"end date": "2020-10-09",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "SSM",
    "course title": "SAFe Scrum Master",
    "partner": "Scaled Agile",
    "course type": "Public",
    "roles": [
      "Scrum Master"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/SAFe Scrum Master.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "During this course, you will learn about the Scrum Master role within an enterprise operating in the SAFe environment. This course will delve into the specifics of what a Scrum Master role looks like at an enterprise level, not just in the context of a Scrum team. You will step away from this course enabled to plan and implement the Program Increment (PI), which is essential to align every level of an organization operating in a SAFe environment. Because this course is focused on how a Scrum Master fits into an organization at an enterprise level, you will learn how to apply Scrum in every part of your organization, as well as how to use iterative planning in your organization.",
      "what youll learn": "In addition to learning about the role of Scrum Master at an enterprise level, you will also discover how acting as a coach and using servant leadership methods will enable you to create successful Agile teams. Trainers will also demonstrate how the formation of these Agile teams can help your organization reach goals and thrive as they seek to met business goals.\nWhen you complete this course and gain the Certified SAFe® Scrum Master certificate, this certification will demonstrate to companies that you are equipped and ready to lead Agile teams in a SAFe environment, and that your servant leadership and coaching skills will bring tremendous growth and value to their organizations.",
      "length": "2 days",
      "effort": "16 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-12-07",
				"end date": "2020-12-08",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-11-22",
				"end date": "2020-11-23",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "POPM",
    "course title": "SAFe Product Owner / Product Manager",
    "partner": "Scaled Agile",
    "course type": "Public",
    "roles": [
      "Product Owner",
      "Business Analyst"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/POPM.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "If you are seeking to learn how to become a successful Product Owner or Product Manager within a Lean enterprise, this course is designed for you. In this two day course, you will learn the skills necessary to be able to lead a team to deliver high value as you seek to deliver successful products in your organization.",
      "what youll learn": "Trainers will equip you with the knowledge and understanding you need in order to be an effective Product Owner/Product Manager within the Agile Release Train (ART). You will discover how you can utilize Lean thinking within the Agile process as you break down Epics first into Features, and then into Stories. In addition, you will learn about the refinement process and how to best refine and manage features, stories, and product backlogs within Iterations and any Program Increments set forth by your enterprise. Finally, you will learn about Continuous Delivery and DevOps, and how these two entities add to the ongoing improvement that takes place within the Agile Release Train (ART).",
      "length": "2 days",
      "effort": "16 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2021-01-10",
				"end date": "2021-01-11",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2021-02-13",
				"end date": "2021-02-14",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "SGP",
    "course title": "SAFe for Governments",
    "partner": "Scaled Agile",
    "course type": "Public",
    "roles": [
      "Scrum Master",
      "Product Owner",
      "Business Analyst"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/SGP.svg",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "This course is designed to enable you to be prepared and ready to be at the forefront of a Lean-Agile transformation initiative within a program operating in an agency run by the government. Attendees will learn how to utilize the Scaled Agile Framework® in their government agency in order to provide maximum value through the Lean-Agile transformation.",
      "what youll learn": "During this course you will learn how and why Lean-Agile is a mindset, and the reasons it is essential to bring this mindset as a foundation in a government agency before beginning the transformation. Additionally, you will learn about Agile Release Trains (ART) and how to best utilize them once transformation begins. You will also learn about tailor-made leadership skills and strategies that are best suited to delivering successful transformation and change in the government sector. Trainers will provide best practices and advice on how to best create successful Agile teams, programs, and how to best manage the technology investments that take place in government agencies within the Lean mindset and flow. Finally, you will learn about how to contract in an Agile environment, how to launch your program, and how to ensure you are using SAFe to plan in such a way that ensures you will deliver value to your government agency.",
      "length": "2 days",
      "effort": "16 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-08-22",
				"end date": "2020-08-23",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-08-27",
				"end date": "2020-08-28",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "SA",
    "course title": "Leading SAFe",
    "partner": "Scaled Agile",
    "course type": "Public",
    "roles": [
      "Scrum Master",
      "Product Owner",
      "Business Analyst",
      "Developer",
      "QA",
      "UI/UX",
      "Content Writer"
    ],
    "icon file": "https://firebasestorage.googleapis.com/v0/b/zengage-learning.appspot.com/o/trainingpage%2FCourse%20Logos%2FLeading%20Safe.png?alt=media&token=035ce256-3a4d-4401-89c4-30cd02ceb36f",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "The goal of this two day course is to equip you with the knowledge that is needed in order to be at the forefront of a Lean-Agile enterprise. Leading a Lean-Agile enterprise is a demanding task, and this course will provide you with a deep understanding of the Scaled Agile Framework® (SAFe®), so that you can take that framework and apply it to an enterprise.",
      "what youll learn": "During the course, attendees will learn about how to become masters of Business Agility so that they can use that expertise to rise to the top in the market. Discussions will be centered around how to develop agility within teams and in the technical space, and how to use that agility to reorient how value flows in the organization. Additional discussions and sessions will provide attendees with training on how to embrace a mindset centered around the customer, as well as how to implement design thinking, as they deliver products within an agile methodology. Attendees will also be instructed on how to orchestrate and use PI Planning events, as well as how to manage and direct different Agile Release Trains (ARTs) that run concurrently. Finally, attendees will learn how to execute a Lean Portfolio Management function within their enterprises.",
      "length": "2 days",
      "effort": "16 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-05-24",
				"end date": "2020-05-25",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-07-29",
				"end date": "2020-07-30",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "SASM",
    "course title": "SAFe Advanced Scrum Master",
    "partner": "Scaled Agile",
    "course type": "Public",
    "roles": [
      "Scrum Master"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/SASM.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "Are you a current Scrum Master looking to sharpen your skills and move up in your career? This course is designed with you in mind. In this two day course, you will learn how to use your leadership skills to utilize Agile skills and principles in order to lead teams, programs, and whole enterprises to great success as they seek to implement a Scaled Agile Framework (SAFe®).",
      "what youll learn": "As a Scrum Master you are focused on leading your teams, and this course will help take you to the next step by providing instruction on how to facilitate communication and interaction across multiple teams as they work in unison to support and encourage program goals. Trainers will show you how to improve your current Scrum mindset by introducing you to the concept of scalable engineering and the practices of DevOps. In addition, trainers will demonstrate how you can use Kanban principles to create value that maintains a constant flow of improvement, and how you can best support the interactions of key stakeholders involved at both the program and enterprise levels. Finally, you will be equipped with knowledge and tools that will enable you to create teams who perform at the highest levels.",
      "length": "2 days",
      "effort": "16 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-06-20",
				"end date": "2020-06-21",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-07-24",
				"end date": "2020-07-25",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "SDP",
    "course title": "SAFe DevOps",
    "partner": "Scaled Agile",
    "course type": "Public",
    "roles": [
      "Developer",
      "QA",
      "UI/UX"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/SDP.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "This is a two-day course focused on highlighting the DevOps mindset to enable Agile team members to deliver solutions in a rapidly changing world.  Encompassing problem definition, development, testing, deployment and support, DevOps is crucial to success in the current fast-paced environment.  This course will furnish a strong background in DevOps, not only to developers but also to every member of an agile team.",
      "what youll learn": "After this two-day intensive course, participants will learn the basics of DevOps, how it fits into the Agile development process, and how to build a customized development/deployment pipeline that works for their organization.  You’ll learn a CALMR approach to DevOps which will enable you to recognize broken processes and not merely automate them.  In addition, you’ll learn a set of tools and practices that will speed and secure your develop/deploy pipeline.  Upon completing the course, you will be eligible to take the Certified SAFe® DevOps Practitioner exam.",
      "length": "16 hours (2 days) in-person class",
      "effort": "5 hrs/week",
      "reviews": [
        "There’s a lot more to DevOps than learning how to program – this class highlights the areas in the pipeline that really matter.",
        "I was able to pass the certification exam and implement better DevOps after taking this class.",
        "I'm not a developer, but I found this course invaluable in understanding the DevOps process.  It really helped my career progression.",
        "My instructor was great. The interactivity helped to drive home the information, and I was able to put it to use quickly.  Highly recommended."
      ]
    },
    "classes": [
      {
        "start date": "2020-12-09",
				"end date": "2020-12-10",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-09-14",
				"end date": "2020-09-15",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "ARCH",
    "course title": "SAFe for Architects",
    "partner": "Scaled Agile",
    "course type": "Public",
    "roles": [
      "Scrum Master",
      "Product Owner"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/ARCH.svg",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "Architects in an Agile environment need to understand how to engage their entire organization to improve value flow.  Senior System, Solution and Enterprise Architects will learn how to architect in a way that enables DevOps and Release on Demand.  They’ll understand how to incorporate vision, intent and roadmaps in their designs, and will obtain a deeper appreciation for how architects contribute to an Agile/Lean organization.",
      "what youll learn": "The SAFe for Architects course will give senior technical contributors the skills and understanding to align their designs with the business value, and to steer toward the continuous system-of-systems flow.  Completion of the course allows the participant to take the Certified SAFe® Architect exam.",
      "length": "24 hours (3 days) in-person class",
      "effort": "5 hrs/week",
      "reviews": [
        "I’ve been a system architect for years – this class enabled me to integrate my experience with the principles of Agile/Lean. Thanks!",
        "I started with very little knowledge about how agile actually works, but the class provided more than enough to start implementing the techniques in my architecture.",
        "Wow – three days was like drinking from a fire hose, and at the end we could understand how to align architecture with business value.",
        "My instructor was great. They kept the energy level high, and we were all engaged.  A must for any architect looking to employ Agile principles. "
      ]
    },
    "classes": [
      {
        "start date": "2020-10-12",
				"end date": "2020-10-13",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-10-21",
				"end date": "2020-10-22",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "SP",
    "course title": "SAFe for Teams",
    "partner": "Scaled Agile",
    "course type": "Public",
    "roles": [
      "Scrum Master",
      "Product Owner",
      "Business Analyst",
      "Developer",
      "QA",
      "UI/UX",
      "Content Writer"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/Safe Fro Teams.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "This two-day course provides attendees with intermediate-level information about using the Scaled Agile Framework® (SAFe®) as a team member Lean-Agile enterprise.  We first review the key concepts behind iterative software development in a SAFe environment, which include managing product backlogs from user stories and requirements, demonstrating value, and incremental and iterative delivery.  We then cover the daily responsibilities of an Agile practitioner and their use of Scrum, Kanban, and Extreme Programming.",
      "what youll learn": "After completing the course, participants will be able to demonstrate their knowledge of the theory and practice needed for participating as a SAFe practitioner in their enterprise.  All students who successfully complete the course will be prepared to take the Certified SAFe® Practitioner (SP) exam.",
      "length": "2 days",
      "effort": "16 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-05-21",
				"end date": "2020-05-22",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-06-11",
				"end date": "2020-06-12",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "RTE",
    "course title": "SAFe Release Train Engineer",
    "partner": "Scaled Agile",
    "course type": "Public",
    "roles": [
      "Scrum Master",
      "Product Owner",
      "Business Analyst",
      "Developer",
      "QA"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/RTE.svg",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "This intermediate- to advanced-level three-day course provides attendees the knowledge to implement Agile Release Trains (ARTs) using the Scaled Agile Framework® (SAFe®) in a Lean-Agile enterprise.  The training is oriented towards Agile leaders, coaches, and Scrum Masters. Starting with a review of Lean-Agile principles, you will be guided through the intricacies of Agile Release Trains and the challenges for implementing these principles in an enterprise setting.",
      "what youll learn": "A Certified SAFe Release Train Engineer certificate holder will be expected to have a thorough understanding of the key Lean-Agile concepts and practices. From the perspective of an already expert SAFe practitioner, the course prepares the student for advanced leadership, coaching and Scrum Master responsibilities in a enterprise SAFe environment.  Instructors draw from their own real-life experience to immerse the student in actual business scenarios.  From there, instructors guide students to create, manage and deploy ARTs. As this is intermediate- to advanced-level training, students gain an appreciation both for the power, as well as the shortcomings, of ARTs in an enterprise setting.",
      "length": "3 days",
      "effort": "24 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-04-20",
				"end date": "2020-04-21",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-07-24",
				"end date": "2020-07-25",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "ASE",
    "course title": "Agile Software Engineering",
    "partner": "Scaled Agile",
    "course type": "Public",
    "roles": [
      "Developer",
      "QA",
      "UI/UX"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/ASE.svg",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "This three-day course provides attendees with the foundational knowledge required to establish their credentials as a Certified Scaled Agile Framework® (SAFe®) Agile Software Engineer. We start with principles behind iterative software development in a SAFe environment, which include the key concepts of managing product backlogs from user stories and requirements, demonstrating value, and incremental and iterative delivery.  An Agile Software Engineer must be equally knowledgeable in DevOps as well as in Lean-Agile, and our expert faculty provide a comprehensive overview.",
      "what youll learn": "A Certified Agile Software Developer certificate holder will be expected to show competency in all aspects of an Agile iterative software development environment.  From the SAFe software developer’s perspective, the course prepares the student in all aspects of the Agile software development process.  Instructors use real-life examples to show students key SAFe skills and then students are given an opportunity to practice the same skills.  As in other SAFe certificate programs, participants in the class explore the importance of adopting a customer-centric mindset and design thinking approach to agile product delivery.",
      "length": "3 days",
      "effort": "24 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-06-02",
				"end date": "2020-06-04",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-07-05",
				"end date": "2020-07-07",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "LPM",
    "course title": "Lean Portfolio Management",
    "partner": "Scaled Agile",
    "course type": "Public",
    "roles": [
      "Scrum Master",
      "Product Owner",
      "Business Analyst"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/LEan Portfolio Management.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "A foundational Lean-Agile and Portfolio operations course for SAFe portfolio managers.",
      "what youll learn": "A Certified SAFe Lean Portfolio Manager certificate holder will be expected to show competency in all aspects of managing an Agile iterative software development environment.  From the SAFe portfolio manager's perspective, the course prepares the student to demonstrate their expertise in managing an enterprise-wide portfolio of Agile projects. Instructors draw from their own real-life industry experience to show students key SAFe techniques for establishing a portfolio vision, for performing Lean portfolio budgeting, port and for using portfolio tools like Portfolio Kanban. Students are given an opportunity to practice and apply these same skills with scenarios drawn from actual industry problems. As this is a foundational level course, participants gain an appreciation both for the power, as well as the shortcomings, of Lean portfolio management in an enterprise setting.",
      "length": "3 days",
      "effort": "24 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-09-22",
				"end date": "2020-09-23",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-09-28",
				"end date": "2020-09-29",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "APM",
    "course title": "Agile Product Management",
    "partner": "Scaled Agile",
    "course type": "Public",
    "roles": [
      "Scrum Master",
      "Product Owner",
      "Business Analyst"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/APM.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "This foundational three-day course provides attendees the background required to achieve the Certified SAFe® Agile Product Manager certification. The training is oriented towards product managers, leaders and coaches. Starting with a review of Lean-Agile principles, you will be guided through the intricacies of Agile product management and the challenges for implementing these principles in an enterprise setting. ",
      "what youll learn": "A Certified SAFe® Agile Product Manager certificate holder will be expected to have a thorough understanding of key Lean-Agile concepts and practices for both software development as well as product management. From the perspective of an Agile product manager, the course prepares the student for advanced leadership and management responsibilities in a enterprise SAFe environment. Course instructors draw from their own real-life experience to immerse the student in actual business scenarios.  From there, instructors guide students to create, manage and deploy ARTs.",
      "length": "3 days",
      "effort": "24 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-04-28",
				"end date": "2020-04-30",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-07-12",
				"end date": "2020-07-14",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "CAL1",
    "course title": "Certified Agile Leadership I",
    "partner": "Scrum Alliance",
    "course type": "Public",
    "roles": [
      "Scrum Master",
      "Product Owner",
      "Business Analyst",
      "Developer",
      "QA",
      "UI/UX",
      "Content Writer"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/SAI_Certification_CAL1_RGB.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "This foundational two-day course provides attendees the background required to achieve the Certified Agile Leadership 1 certification from the Scrum Alliance. The training is oriented towards information technology (IT) product managers, supervisors, directors, leaders, coaches, or anyone in a managerial position who is interested in learning to apply Agile principles to their leadership.",
      "what youll learn": "The applicability of Agile management techniques extends throughout the IT industry and beyond. This course will demonstrate many of those techniques that prove useful for common organizational and management challenges, such as, effective leadership of distributed and diverse teams, delivering value, and promoting the Scrum values of courage, focus, commitment, respect and openness. From their experience in both the Agile and non-Agile worlds, Apex’s instructors will show you how to value: individuals and interactions over processes and tools, working software over comprehensive documentation, customer collaboration over contract negotiation, and responding to change over following a plan.\nA Certified Agile Leadership 1 certificate holder will be expected to have an understanding of management practices, particularly those found in IT organizations. From the perspective of an experienced IT manager, the course prepares the student to apply Agile techniques to attain advanced leadership and management responsibilities in a enterprise environment. Course instructors draw from their own real-life experience to immerse the student in actual business scenarios.  From there, instructors provide guidance in the application of Agile techniques.",
      "length": "2 days",
      "effort": "16 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2021-01-10",
				"end date": "2021-01-11",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-11-11",
				"end date": "2020-11-12",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "PMP",
    "course title": "Project Management Professional",
    "partner": "PMI",
    "course type": "Public",
    "roles": [
      "Scrum Master",
      "Product Owner",
      "Business Analyst"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/Project Management Professional.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "In this exciting course, you will explore the many aspects and parts that impact the successful management of projects. You will learn about project, program, and portfolio management, and the best practices that accompany each.",
      "what youll learn": "During this course you will dive deep into the PMBOK, where you will learn about the project life cycle. In addition, you will learn about the five process groups lying within the project lifecycle: Initiating, Planning, Executing, Monitoring and Controlling, and Closing. You will then delve into the 10 Knowledge Areas that make up every project: Integration, Scope, Schedule, Cost, Quality, Resource, Communications, Risk, Procurement, and Stakeholder Management. Your trainers will help you understand the inputs, tools and techniques, and outputs within each knowledge area.\nAt the end of the course, your trainers will provide you specific instructions and tips on what to do before taking the PMP exam that will guarantee you pass on the first attempt.",
      "length": "4 days",
      "effort": "32 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-05-11",
				"end date": "2020-05-14",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-07-20",
				"end date": "2020-07-23",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "ACP",
    "course title": "PMI Agile Certified Practitioner",
    "partner": "PMI",
    "course type": "Public",
    "roles": [
      "Scrum Master",
      "Product Owner",
      "Business Analyst",
      "Developer",
      "QA",
      "UI/UX",
      "Content Writer"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/pmi-acp-600px.png",
    "details": {
      "cost": "1000",
      "class hours": "16",
      "about this course": "In this two day course, you will learn about the best practices and principles of Agile. The Agile way of working is taking multiple industries by storm, and being equipped with a proper understanding of the various Agile methodologies is key to being successful in the current market.",
      "what youll learn": "This course will provide you an in-depth look at some of the most popular Agile methodologies, like Scrum, Kanban, extreme programming (XP), test-driven development (TDD) and Lean. Throughout the two days of this training course, you will delve deep into these methodologies, and learn the ins and outs of each. You will be prepared to take the PMI-ACP certification test and gain the PMI-ACP certification, which will demonstrate to your colleagues, bosses, and stakeholders involved in your projects that you have a strong understanding of agile. Possessing the PMI-ACP certification will show that you are able to implement agile principles into the workplace in order to bring your organization and team to market success.",
      "length": "2 days",
      "effort": "16 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-08-18",
				"end date": "2020-08-19",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-07-01",
				"end date": "2020-07-02",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "VSW",
    "course title": "Value-Stream Workshop",
    "partner": "Custom",
    "course type": "Corporate",
    "roles": [
      "Scrum Master",
      "Product Owner",
      "Business Analyst",
      "Developer",
      "QA",
      "UI/UX",
      "Content Writer"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/VSELogo.jpg",
    "details": {
      "cost": "5000",
      "class hours": "16",
      "about this course": "Value Streams are all about implementing practices and optimizing an organization so that it can provide a continuous flow of value to its customers. We find that today’s businesses are too often focused on delivering products and specific product features without taking into consideration their ultimate value to the customer. Value streams start with and focus specifically on business value provided to the customer.",
      "what youll learn": "Understanding value streams becomes increasingly important as the complexity of your organization grows. Drawing upon parallels from the Scaled Agile Framework (SAFe), many of the techniques that help with coordination and interconnection between Agile processes will also be shown effective at coordinating and delivering value at scale.\nIn this workshop you will partner and collaborate with other students representing a broad swath of your corporate know-how. Under the expert guidance of experienced facilitators, you will have the opportunity to immerse yourself in several actual business challenges and then learn how value stream coordination can help you manage the many competing requirements that may interfere with delivering value. You will have the opportunity to experience, practice, and apply new ways of thinking about delivering customer value. In demonstrations of complex organizations, you will see how these practices scale to meet your challenges.",
      "length": "2 days",
      "effort": "16 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-11-03",
				"end date": "2020-11-04",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-11-12",
				"end date": "2020-11-13",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "SPM",
    "course title": "SAFe Portfolio Management",
    "partner": "Custom",
    "course type": "Corporate",
    "roles": [
      "Scrum Master",
      "Product Owner",
      "Business Analyst"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/SPMLogo.jpg",
    "details": {
      "cost": "5000",
      "class hours": "16",
      "about this course": "The SAFe® Portfolio Management corporate training fits hand in glove with our SAFe Lean Portfolio Manager certificate training. Similar to the certificate training, the course prepares the student to demonstrate their expertise in managing an enterprise-wide portfolio of Agile projects. Instructors draw from their own real-life industry experience to show students key SAFe techniques for establishing a portfolio vision, for performing Lean portfolio budgeting, port and for using portfolio tools like Portfolio Kanban. Students are given an opportunity to practice and apply these same skills with scenarios drawn from actual industry problems. Whereas the certificate training is a foundational level course, the corporate training is far more detailed and specifically targeted for the user’s business challenges.",
      "what youll learn": "In this workshop you will partner and collaborate with other students representing a broad swath of your corporate know-how. Under the expert guidance of experienced facilitators, you will have the opportunity to immerse yourself in several actual business challenges and then learn how SAFE portfolio management techniques can help you manage the many competing requirements that may interfere with delivering value. Alongside a deep dive into the complexities of your organization, you will have the opportunity to see and experience how organizations like yours apply SAFe practices to meet their business challenges.",
      "length": "2 days",
      "effort": "16 hrs/week",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-08-17",
				"end date": "2020-08-18",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-09-12",
				"end date": "2020-09-13",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "PIW",
    "course title": "Program Increment Workshop",
    "partner": "Custom",
    "course type": "Corporate",
    "roles": [
      "Scrum Master",
      "Product Owner",
      "Business Analyst"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/PIW Logo.png",
    "details": {
      "cost": "6000",
      "class hours": "24",
      "about this course": "In an Agile development environment, a program increment (PI) is a timebox during which the Agile Release Train incrementally delivers value through deploying new systems and software.  It is the summation of a set of sprints, and usually lasts 8-12 weeks.  The PI is the final artifact of the scrum framework, and represents a usable solution\nThis workshop guides participants through the process of defining the program increment, guiding its development cycle, and realizing its functionality through deployment.  Practicing Scrum without a program increment is merely wasted effort and a lost opportunity.  This customized workshop shows your team how to successfully define and deliver the PI.",
      "what youll learn": "Everyone in the Agile team will benefit from this workshop.  You’ll learn how to set realistic goals for the program increment, how to ensure sprints will deliver the PI, and how to utilize program increments to continuously improve the outcomes of your agile development process.",
      "length": "Customized for each engagement; typically 3-6 working days",
      "effort": "6 hrs/day",
      "reviews": [
        "We didn’t know the difference between a sprint and a program increment.  Now we do, and it has really improved our value flow. Thanks!",
        "My company was getting stuck between sprints, so this workshop helped us to keep the train on the track.",
        "Every day we learned something new.  It was a great benefit to our team.",
        "Highly recommended – Raj showed us how to define program increments that make sense, enabling us to succeed."
      ]
    },
    "classes": [
      {
        "start date": "2020-05-16",
				"end date": "2020-05-18",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-06-14",
				"end date": "2020-06-16",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "IA",
    "course title": "Inspect & Adapt",
    "partner": "Custom",
    "course type": "Corporate",
    "roles": [
      "Scrum Master",
      "Product Owner",
      "Business Analyst",
      "Developer",
      "QA",
      "UI/UX",
      "Content Writer"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/I&A Logo.jpg",
    "details": {
      "cost": "5000",
      "class hours": "20",
      "about this course": "At the core of the Agile principles is the concept of regular reflection and tuning.  Inspect & Adapt takes place at the end of each Program Increment.  All of the stakeholders participate in the event, identifying backlog items for improvement and bolstering the culture of continuous learning.\nThe Inspect & Adapt workshop will demonstrate how this Agile principle can be implemented in your environment.  From the workshop, you will gain the skills needed to be introspective about your successes and areas needing more focus.",
      "what youll learn": "The Inspect & Adapt workshop allows you to release the potential of compounding your triumphs using Agile.  You’ll see how to demonstrate the program increment, how to measure its benefits both qualitatively and quantitatively, and how to master the complicated process of reflection and continuous improvement.",
      "length": "Customized for each engagement; typically 2-3 working days",
      "effort": "3 hrs/day",
      "reviews": [
        "We didn’t know the difference between a sprint and a program increment.  Now we do, and it has really improved our value flow. Thanks!",
        "My company was getting stuck between sprints, so this workshop helped us to keep the train on the track.",
        "Every day we learned something new.  It was a great benefit to our team.",
        "Highly recommended – Raj showed us how to define program increments that make sense, enabling us to succeed."
      ]
    },
    "classes": [
      {
        "start date": "2020-12-08",
				"end date": "2020-12-09",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-12-07",
				"end date": "2020-12-08",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "PMW",
    "course title": "Product Management Workshop",
    "partner": "Custom",
    "course type": "Corporate",
    "roles": [
      "Scrum Master",
      "Product Owner",
      "Business Analyst"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/PMV Logo.jpg",
    "details": {
      "cost": "5000",
      "class hours": "8",
      "about this course": "Product Management has been around as long as there have been products, but it has been redefined in the Agile world.  In an Agile framework, product management is redefined to allow for building and deploying products in a new way.  The ability to work with an iterative development cycle and a fast-moving and self-organized team requires a different approach.",
      "what youll learn": "This workshop highlights the ways that product management in an Agile environment can maintain high standards while taking advantage of the flexibility and quick delivery of value to customers.  Product managers learn how to set a clear vision for the team, guide the backlog, and maintain alignment with the business goals. Using skills from this workshop, project managers and other stakeholders will get first-hand experience in how to identify and prioritize features, manage the backlog, and see that the goals of each program increment are realized.",
      "length": "Customized for each engagement; typically 2-4 working days",
      "effort": "3 hrs/day",
      "reviews": [
        "This was great – I now understand how to incorporate the Agile principles with product management. Thanks!",
        "Well worth the time.  Our product management has improved and will continue to do so as we continue our implementation.",
        "We got a lot out of the workshop – I was glad to have been invited to participate.",
        "This was the best use of my time in a long while.  Implement Agile requires a new way to do our jobs, and this workshop has opened my eyes.  Just great."
      ]
    },
    "classes": [
      {
        "start date": "2020-09-21",
				"end date": "2020-09-22",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-08-30",
				"end date": "2020-08-31",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "TB",
    "course title": "Team Building",
    "partner": "Custom",
    "course type": "Corporate",
    "roles": [
      "Scrum Master",
      "Product Owner"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/PMV Logo.png",
    "details": {
      "cost": "5000",
      "class hours": "12",
      "about this course": "Are your teams suffering from lack of cohesion and connectedness? Are you and they feeling disconnected and frustrated because they just can’t seem to work well together? If these questions describe your teams, then this team building workshop is the perfect fit for you.",
      "what youll learn": "Our professional team building trainers have years of experience helping teams connect and form bonds, which enable them to be happier, more effective, and increase their performance. During this one day workshop, your team will participate in multiple team-building activities, from games to interactive discussions with one another, all of which will help them discover how to better connect and work with one another.\nOur trainers design these activities based on your team’s individual needs, so you can rest assured that this workshop will be tailor made for your team. Through these activities and reflective discussions, every member of your team will learn how to appreciate the unique contributions brought to the table by each member, and how they can all work together to maximize their effectiveness by recognizing their individual strengths and contributions. By the end of this workshop, we guarantee that your team members will have formed bonds, identified how to continue and strengthen their ties to each other, and be ready and excited to work together. ",
      "length": "1 day",
      "effort": "8 hrs/day",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-07-29",
				"end date": "2020-07-29",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-06-29",
				"end date": "2020-06-29",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  },
  {
    "course code": "CSKW",
    "course title": "Customized Scrum/Kanban Workshop",
    "partner": "Custom",
    "course type": "Corporate",
    "roles": [
      "Scrum Master",
      "Product Owner",
      "Business Analyst",
      "Developer",
      "QA",
      "UI/UX",
      "Content Writer"
    ],
    "icon file": "gs://zengage-learning.appspot.com/trainingpage/Course Logos/CSCW Logo.jpg",
    "details": {
      "cost": "5000",
      "class hours": "24",
      "about this course": "A workshop designed to help teams be equipped to use Scrum and Kanban principles in their working environments.",
      "what youll learn": "In our Kanban team workshops, your team will learn about what Kanban actually is and the best practices associated with using it. You will learn about how and when to use it in your team environment, and how you can best incorporate it in your team with other Agile practices you are currently using, or hope to use in future. Our trainers will also demonstrate how to create a Kanban board, and will show you many examples of how different teams use Kanban boards. By the end of this workshop, your team will be ready, able, and empowered to incorporate and use Kanban in your organization to maximize their success and delivery of products. \nIf Scrum training is what your team needs, then look no further. Our Scrum workshops are designed to equip your team with a deep understanding of the Scrum framework and be able to then apply Scrum principles in a working environment. During this one day course, your team will learn about Agile principles and the foundational values and roles that form the basis of Scrum. Trainers will provide instruction on Scrum theory, the Scrum framework, and the role of the Scrum Master within the Scrum environment. Your team will participate in workshops during the course, where they will practice applying the knowledge about Scrum into real world situations and work environments. At the end of the course, your team will understand the Scrum framework, be able to apply this knowledge through application, Scrum events, and Scrum roles. ",
      "length": "1 day",
      "effort": "8 hrs/day",
      "reviews": [
        "Great course; I learned everything I needed and more! I am excited to implement these skills into my role in my organization.",
        "Fantastic experience! Highly recommended! I am looking forward to sharing what I’ve learned with my enterprise.",
        "Raj is an excellent instructor, always willing to help and great at explaining concepts.",
        "This course equipped me with the skills I needed to grow and advance in my career. Many thanks!"
      ]
    },
    "classes": [
      {
        "start date": "2020-08-17",
				"end date": "2020-08-17",
        "instructor": "Heda",
        "city": "London",
        "country": "UK"
      },
      {
        "start date": "2020-08-12",
				"end date": "2020-08-12",
        "instructor": "Heda",
        "city": "Boston",
        "country": "US"
      }
    ]
  }
]
